<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class SectorSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('sectors')->insert([
            [
                'name' => "АУП",
                'name_uz' => "Маъмурий-бошқарув ходимлари"
            ],
            [
                'name' => "Сектор по изучению конкурентоспособности отраслей экономики и инвестиционной активности",
                'name_uz' => "Иқтисодиёт тармоқлари рақобатбардошлиги ва инвестицион фаолликни ўрганиш шўъбаси"
            ],
            [
                'name' => "Сектор по социально-экономическу развитию регионов",
                'name_uz' => "Ҳудудларни ижтимоий-иқтисодий ривожлантириш шўъбаси"
            ],
            [
                'name' => "Сектор по развитию деятелности промышленных кластеров",
                'name_uz' => "Саноат кластерлари фаолиятини ривожлантириш шўъбаси"
            ],
            [
                'name' => "Сектор по изучению согласованности параметров макроэкономической политики и прогнозирования",
                'name_uz' => "Макроиқтисодий сиёсат параметрлари мутаносиблигини ўрганиш ва прогнозлаш шўъбаси"
            ],
            [
                'name' => "Сектор по изучению деятелности в банковско-финансовой сфере и на рынке капитала",
                'name_uz' => "Банк-молия ва капитал бозори фаолиятини ўрганиш шўъбаси"
            ],
            [
                'name' => "Сектор по изучению внешнеэкономической деятельности интеграционный процессов",
                'name_uz' => "Ташқи иқтисодий фаолият ва интеграция жараёнларини ўрганиш шўъбаси"
            ],
            [
                'name' => "Сектор по связям с общественностью и маркетинга",
                'name_uz' => "Жамоатчилик билан алоқалар ва маркетинг шўъбаси"
            ],
            [
                'name' => "Сектор по внедрению IT технологий и интеграций баз данных",
                'name_uz' => "IT-технологияларни жорий этиш ва маълумотлар базасини интеграциялаш шўъбаси"
            ],
            [
                'name' => "Акселератор социално-экономических реформ",
                'name_uz' => "Ижтимоий-иқтисодий ислоҳотлар акселератори"
            ],
            [
                'name' => "Редакция журнала Экономическое обозрение",
                'name_uz' => "«Экономическое обозрение» журнали таҳририяти"
            ],
            [
                'name' => "Каракалпакский филиал",
                'name_uz' => "Қорақалпоғистон Республикаси филиали"
            ],
            [
                'name' => "Джиззакский филиал",
                'name_uz' => "Жиззах вилояти филиали"
            ],
            [
                'name' => "Наманганский филиал",
                'name_uz' => "Наманган вилояти филиали"
            ],
            [
                'name' => "Самаркандский филиал",
                'name_uz' => "Самарқанд вилояти филиали"
            ],
            [
                'name' => "Кашкадаринский филиал",
                'name_uz' => "Қашқадарё вилояти филиали"
            ]
        ]);

    }
}
