app/Notifications/NewTaskNotification.php

    public function toTelegram($notifiable): string
    {
        $locale = $notifiable->locale ?? 'ru';
        $creator = User::find($this->task->creator_id);
---
select * from `users` where `id` = 1 limit 1