app/Http/Livewire/HelpingTasks.php

    public function mount(){
        $this->chosen_project = Null;
        $this->tasks1 = TaskUser::where('user_id', Auth::user()->id)->get();

        $projects_arr = array();
        $this->tasks_id = array();

        $this->helping_projects = collect([]);
        $this->tasks_without_project = collect([]);

        foreach($this->tasks1 as $task){
            $this->helping_task = Task::where('id', $task->task_id)->first();
            if($this->helping_task->project_id != NULL){
                array_push($projects_arr, $this->helping_task->project->name);
                array_push($this->tasks_id, $this->helping_task->id);
            }else{
                $this->tasks_without_project = $this->tasks_without_project->merge([$this->helping_task]);
            }
        }

        $unique_projects = array_unique($projects_arr);
        foreach($unique_projects as $project){
            $project_collection = Project::with(['tasks' => function($query){
                $query->where('user_id', Auth::user()->id);
            }])->where('name', $project)->first();
---
select * from `task_user` where `user_id` = 2
select * from `tasks` where `id` = 2 limit 1
select * from `projects` where `name` = 'Yangi proyekt' limit 1
select * from `tasks` where `tasks`.`project_id` in (1) and `user_id` = 2