app/Http/Livewire/OrderedTable.php

    public function mount(){
        $this->projectId = "Empty";
        $this->status = "Empty";
        $this->username = Auth::user()->name;
        $this->project = Project::all();
        $this->tasks = Task::with('user:id,name,sector_id,role_id')->where('creator_id', Auth::user()->id)->where('project_id', Null)
                        ->orderBy('deadline', 'ASC')->get();
        $this->chosen_project = Project::with(['tasks' => function($query){
            $query->with('user')->where('creator_id', Auth::user()->id);
        }])->where('user_id', Auth::user()->id)->get();
---
select * from `projects`
select * from `tasks` where `creator_id` = 1 and `project_id` is null order by `deadline` asc
select * from `users` where `users`.`id` in (2, 3, 4, 5, 6, 7, 9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20, 21, 25, 26, 27, 28, 29, 31, 34, 35, 36, 37, 39, 40, 41, 44, 45)
select * from `projects` where `user_id` = 2
select * from `tasks` where `tasks`.`project_id` in (1) and `creator_id` = 1
select * from `users` where `users`.`id` in (3)

    public function updated(){
        if($this->projectId == Null){
            if($this->status == "Empty"){
                $this->tasks = Task::with(['user:id,name,sector_id,role_id'])->where('creator_id', Auth::user()->id)->where('project_id', null)->orderBy('deadline', 'ASC')->get();
            }else{
                $this->tasks = Task::with(['user:id,name,sector_id,role_id'])->where('creator_id', Auth::user()->id)->where('project_id', null)->where('status', $this->status)->orderBy('deadline', 'ASC')->get();
            }
            $this->chosen_project = Null;
        }elseif($this->projectId == "Empty"){
            if($this->status == "Empty"){
                $this->tasks = Task::with('user:id,name,sector_id,role_id')->where('creator_id', Auth::user()->id)->where('project_id', null)
                            ->orderBy('deadline', 'ASC')->get();
                $this->chosen_project = Project::with(['tasks' => function($query){
                    $query->with('user')->where('creator_id', Auth::user()->id);
                }])->where('user_id', Auth::user()->id)->get();
            }else{
                $this->tasks = Task::with(['user:id,name,sector_id,role_id'])->where('creator_id', Auth::user()->id)->where('project_id', null)->where('status', $this->status)->orderBy('deadline', 'ASC')->get();
                $this->chosen_project = Project::with(['tasks' => function($query){
                    $query->with('user')->where('creator_id', Auth::user()->id)->where('status', $this->status);
                }])->where('user_id', Auth::user()->id)->get();
            }
        }else{
            $this->tasks = Null;
            if($this->status == "Empty"){
                $this->chosen_project = Project::with(['tasks' => function($query){
                    $query->with('user')->where('creator_id', Auth::user()->id);
                }])->where('id', $this->projectId)->first();
---
select * from `tasks` where `creator_id` = 1 and `project_id` is null order by `deadline` asc
select `id`, `name`, `sector_id`, `role_id` from `users` where `users`.`id` in (39)
select `id`, `name`, `sector_id`, `role_id` from `users` where `users`.`id` in (2, 3, 4, 5, 6, 7, 9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20, 21, 24, 27, 28, 29, 31, 34, 35, 36, 39, 40, 41, 44, 45)
select * from `projects`
select * from `tasks` where `tasks`.`project_id` in (1, 2, 3, 4, 5) and `creator_id` = 1
select * from `users` where `users`.`id` in (2, 3, 4, 5, 6, 7, 9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20, 21, 25, 26, 27, 28, 29, 31, 34, 35, 36, 37, 39, 40, 41, 44, 45)
select * from `tasks` where `creator_id` = 1 and `project_id` is null and `status` = 'Новое' order by `deadline` asc
select `id`, `name`, `sector_id`, `role_id` from `users` where `users`.`id` in (5, 25, 26, 36, 37, 45)
select * from `projects` where `id` = '1' limit 1
select * from `tasks` where `tasks`.`project_id` in (1, 2, 3, 4, 5) and `creator_id` = 1 and `status` = 'Просроченный'
select * from `users` where `users`.`id` in (5, 25, 26, 36, 37, 45)
select * from `projects` where `id` = '3' limit 1
select * from `tasks` where `tasks`.`project_id` in (3) and `creator_id` = 1
select * from `users` where `users`.`id` in (4, 11, 20, 29, 36, 39, 45)