app/Http/Livewire/TasksTable.php

select * from `projects` where `projects`.`id` in (1, 2, 3, 4, 5)
select * from `tasks` where `user_id` = 1 and `project_id` is not null
select * from `projects` where `name` = 'z czxc xzqweqw' limit 1
select * from `projects`
select * from `tasks` where `user_id` = 1 and `project_id` is null order by `deadline` asc
select `id`, `name`, `sector_id`, `role_id` from `users` where `users`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9)
---
    public function mount(){
        $project_tasks = Task::with('project')->where('user_id', Auth::user()->id)->where('project_id', '<>', null)->get();
        $projects_arr = array();

        $user_projects = collect([]);

        foreach($project_tasks as $task){
            array_push($projects_arr, $task->project->name);
        }

        $unique_projects = array_unique($projects_arr);

        foreach($unique_projects as $project){
            $project_collection = Project::where('name', $project)->first();
            $user_projects = $user_projects->merge([$project_collection]);
        }

        $this->projects = $user_projects;

        $this->projectId = "Empty";
        $this->status = "Empty";
        $this->username = Auth::user()->name;
        $this->chosen_project = $user_projects;
        $this->project = Project::all();
        $this->tasks = Task::with('creator:id,name,sector_id,role_id')->where('user_id', Auth::user()->id)->where('project_id', Null)
                        ->orderBy('deadline', 'ASC')->get();

select * from `tasks` where `user_id` = 1 and `status` in ('Новое', 'Выполняется') order by `deadline` asc
select * from `tasks` where `user_id` = 1 and `status` = 'Просроченный' order by `deadline` asc
select `id`, `name`, `sector_id`, `role_id` from `users` where `users`.`id` in (2, 3, 4, 5, 6)
---
    public function updated(){
        if($this->projectId == Null){
            if($this->status == "Empty"){
                $this->tasks = Task::with(['creator:id,name,sector_id,role_id'])->where('user_id', Auth::user()->id)->where('project_id', null)->orderBy('deadline', 'ASC')->get();
            }else{
                $this->tasks = Task::with(['creator:id,name,sector_id,role_id'])->where('user_id', Auth::user()->id)->where('project_id', null)->where('status', $this->status)->orderBy('deadline', 'ASC')->get();
            }
            $this->chosen_project = Null;
        }elseif($this->projectId == "Empty"){
            $this->chosen_project = Null;
            if($this->status == "Empty"){
                $this->tasks = Task::with('creator:id,name,sector_id,role_id')->where('user_id', Auth::user()->id)->whereIn('status', ['Новое' ,'Выполняется'])
                                ->orderBy('deadline', 'ASC')->get();
            }else{
                $this->tasks = Task::with(['creator:id,name,sector_id,role_id'])->where('user_id', Auth::user()->id)->where('status', $this->status)->orderBy('deadline', 'ASC')->get();