app/Http/Livewire/ViewModal.php

    public function taskClicked($id){
        $this->dispatchBrowserEvent('show-modal');
        $this->task = Task::with(['user','comments', 'files'])->where('id', $id)->first();
---
select * from `files` where `files`.`task_id` in (2)
select * from `tasks` where `id` = 2 limit 1
select * from `comments` where `comments`.`task_id` = 2 and `comments`.`task_id` is not null order by `created_at` desc