app/Helpers/AppHelper.php

    public function username($id){
        $user =User::select('name')->where('id', $id)->first();
---
select `name` from `users` where `id` = 1 limit 1