app/Http/Controllers/PageController.php

    public function dashboard(){
        $user = Auth::user();

        if($user->isDirector() || $user->isMailer()){
            $projects = Project::where('user_id', $user->id)->get();
            $sectors = Sector::with('users:id,name,sector_id,role_id')->get();
        }elseif ($user->isHead()) {
            $projects = Project::where('user_id', $user->id)->get();
            $sectors = Sector::with('users:id,name,sector_id,role_id')->get();
---
select * from `projects` where `user_id` = 1
select * from `sectors`
select `id`, `name`, `sector_id`, `role_id` from `users` where `users`.`sector_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11)
select * from `projects` where `user_id` = 2

    public function ordered(){
        $user = Auth::user();

        if($user->isDirector() || $user->isMailer()){
            $projects = Project::where('user_id', $user->id)->get();
            $sectors = Sector::with('users:id,name,sector_id,role_id')->get();
        }elseif ($user->isHead()) {
            $projects = Project::where('user_id', $user->id)->get();
            $sectors = Sector::with('users:id,name,sector_id,role_id')->get();
---
select * from `projects` where `user_id` = 1
select * from `sectors`
select `id`, `name`, `sector_id`, `role_id` from `users` where `users`.`sector_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16)
select * from `projects` where `user_id` = 2

    public function helping(){
        $projects = Project::where('user_id', Auth::user()->id)->get();

        $sectors = Sector::with('users:id,name,sector_id,role_id')->get();
---
select * from `projects` where `user_id` = 2
select * from `sectors`
select `id`, `name`, `sector_id`, `role_id` from `users` where `users`.`sector_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16)

    public function employees(){
        $sectors = Sector::with('users.role')->get();
        $roles = Role::all();
---
select * from `roles` where `roles`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13)
select * from `sectors`
select * from `users` where `users`.`sector_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16)
select * from `roles`