app/Http/Controllers/ProjectController.php

    public function store(Request $request)
    {
        $request->validate([
            'name' => 'required|min:3'
        ]);

        $flight = Project::create([
            'name' => $request->name,
        ]);
---
insert into `projects` (`name`, `user_id`, `updated_at`, `created_at`) values ('z czxc xzqweqw', 1, '2022-02-20 11:56:22', '2022-02-20 11:56:22')