app/Http/Controllers/TaskController.php

insert into `tasks` (`creator_id`, `user_id`, `sector_id`, `project_id`, `name`, `description`, `deadline`, `status`, `updated_at`, `created_at`) values (1, '2', 1, '', 'Test Task 212313131', 'sd sada sd sad sad s asd s sad sad sad sad sad', '2022-02-19', 'Новое', '2022-02-18 06:09:30', '2022-02-18 06:09:30')
insert into `tasks` (`creator_id`, `user_id`, `project_id`, `name`, `description`, `deadline`, `status`, `repeat`, `updated_at`, `created_at`) values ('1', '10', '', 'Test Task 212', 'as dsad sad sad asd ad', '2022-02-26', 'Новое', 'daily', '2022-02-24 12:02:36', '2022-02-24 12:02:36')
---
    public function store(Request $request)
    {
        $request->validate([
            'name' => 'required|min:3|max:255',
            'description' => 'required|min:3',
            'deadline' => 'required|date_format:Y-m-d|after:today',
        ]);


        $task = Task::create([
            'creator_id' => Auth::user()->id,
            'user_id' => $request->user_id,
            'sector_id' => 1,
            'project_id' => $request->project_id,
            'name' => $request->name,
            'description' => $request->description,
            'deadline' => $request->deadline,
            'status' => 'Новое',
        ]);

        $task->executers()->sync($request->helpers, false);

insert into `files` (`task_id`, `name`, `updated_at`, `created_at`) values (514, '1645164570part1.xlsx', '2022-02-18 06:09:30', '2022-02-18 06:09:30')
---
                $fileModel = new File;
                $fileModel->task_id = $task->id;
                $fileModel->name = $filename;
                $fileModel->save();

select * from `projects` where `user_id` = 1
select * from `sectors`
select `id`, `name`, `sector_id`, `role_id` from `users` where `users`.`sector_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11)
---
        $user = Auth::user();

        if($user->isDirector() || $user->isMailer()){
            $projects = Project::where('user_id', $user->id)->get();
            $sectors = Sector::with('users:id,name,sector_id,role_id')->get();

select * from `tasks` where `id` = '511' limit 1
select * from `task_user` where `task_id` = 511
delete from `files` where `id` = 1
delete from `task_user` where `id` = 1
delete from `tasks` where `id` = 511
---
    public function destroy($id)
    {
        $task = Task::where('id', $id)->first();
        $executers = TaskUser::where('task_id', $task->id)->get();

        if($executers){
            foreach ($executers as $executer) {
                $executer->delete();
            }
        }

        if($task->files){
            foreach($task->files as $file){
                Storage::delete('files/'.$file->name);
                $file->delete();
            }
        }

        $task->delete();