app/Http/Controllers/TaskController.php

select * from `task_user` where `task_user`.`task_id` = 514
---
    public function store(Request $request)
    {
        $request->validate([
            'name' => 'required|min:3|max:255',
            'deadline' => 'required|date_format:Y-m-d',
            'file.*' => 'nullable|file|max:5000'
        ]);

        // $user = User::where('id', $request->user_id)->first();

        // if($user->role_id == 2){
        //     $creator = 2;
        // }else{
        //     $creator = $user->id;
        // }

        $new_deadline = $request->deadline;
        foreach($request->users as $usr){
            $user = User::where('id', $usr)->first();

select * from `files` where `files`.`task_id` = 513 and `files`.`task_id` is not null
---
    public function update(Request $request)
    {
        $request->validate([
            'name' => 'required|min:3|max:255',
            'user_ids' => 'required|array|min:1',
            'user_ids.*' => 'exists:users,id',
            'file.*' => 'nullable|file|max:5000',
        ]);

        $baseTask = Task::findOrFail($request->id);
        $groupId = $baseTask->group_id;

        $newDeadline = Carbon::parse($request->deadline);
        $isExtended = $newDeadline->gt(Carbon::parse($baseTask->deadline));

        $groupTasks = $groupId
            ? Task::where('group_id', $groupId)->get()
            : collect([$baseTask]);

        $existingUserIds = $groupTasks->pluck('user_id')->toArray();
        $newUserIds = $request->user_ids;

        // Remove all old grouped tasks if user_ids changed
        if (array_diff($existingUserIds, $newUserIds) || array_diff($newUserIds, $existingUserIds)) {
            foreach ($groupTasks as $task) {
                File::where('task_id', $task->id)->delete();