app/Models/Task.php

select * from `users` where `users`.`id` = 1 limit 1
---
    public function username($id){
        $user = User::find($id);